In [ ]:
#Load a CSV
import pandas as pd

df = pd.read_csv("data.csv")
df.head(10)

In [2]:
#Select speciffic columns
df[['name', 'salary', 'department']]

             name  salary   department
0     Aarav Mehta   65000  Engineering
1   Ananya Sharma   48000    Marketing
2     Rohan Patil   52000        Sales
3      Neha Verma   45000           HR
4     Aditya Nair   70000  Engineering
5    Shruti Desai   55000      Finance
6    Vikram Joshi   50000        Sales
7  Pooja Kulkarni   72000  Engineering
8       Raj Singh   60000      Finance
9   Kavita Pillai   47000    Marketing

In [3]:
#Filter rows
df[df['salary'] > 50000]

   id            name   department  salary  age gender
0   1     Aarav Mehta  Engineering   65000   28      M
2   3     Rohan Patil        Sales   52000   32      M
4   5     Aditya Nair  Engineering   70000   30      M
5   6    Shruti Desai      Finance   55000   29      F
7   8  Pooja Kulkarni  Engineering   72000   26      F
8   9       Raj Singh      Finance   60000   31      M

In [4]:
#Group by and average
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [5]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [7]:
#Missing Values
df.fillna({"salary": df["salary"].mean()}, inplace=True)

In [8]:
#Sort Data
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [9]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [10]:
#Sort employees by salary
df.sort_values("salary", ascending=False)

   id            name   department  salary  age gender  annual_salary
7   8  Pooja Kulkarni  Engineering   72000   26      F         864000
4   5     Aditya Nair  Engineering   70000   30      M         840000
0   1     Aarav Mehta  Engineering   65000   28      M         780000
8   9       Raj Singh      Finance   60000   31      M         720000
5   6    Shruti Desai      Finance   55000   29      F         660000
2   3     Rohan Patil        Sales   52000   32      M         624000
6   7    Vikram Joshi        Sales   50000   35      M         600000
1   2   Ananya Sharma    Marketing   48000   25      F         576000
9  10   Kavita Pillai    Marketing   47000   24      F         564000
3   4      Neha Verma           HR   45000   27      F         540000